const Screen1 = () => {
	return (
		<>
			<p>
				На начальном этапе важно понять с какой целью создается сайт. Без,
				верно, поставленных целей и задач вы не сможете создать качественный
				коммерческий сайт, который будет приносить прибыль. Для получения
				хорошего результата необходимо грамотно продумать функционал сайта,
				юзабилити и наполнение сайта.
			</p>
			<br />

			<p>
				Проект менеджер, это лицо, которое следит за качеством работ над
				проектом на всех его этапах. Менеджер погружается в специфику бизнеса
				клиента, целевой аудитории и особенностей продукта компании, проводит
				анализ конкурентов и ищет оптимальные решения для выбора платформы для
				будущего сайта. Он определяет цели и задачи сайта, просчитывает кол-во
				посадочных страниц, ведет переговоры с клиентом. Проект менеджер ставит
				задачи всем участникам проекта, а также, ведет контроль за их
				своевременном исполнением.
			</p>
		</>
	)
}

const Screen2 = () => {
	return (
		<>
			<p>
				Перед тем как поставить техническое задание дизайнеру, необходимо
				подготовить макет, для этого Маркетолог изучает сайты конкурентов и
				берет лучшие идеи готовых блоков, которые будут присутствовать на
				будущей странице.
			</p>
			<br />

			<p>
				Так же на сайте могут присутствовать дополнительные элементы выделяющие
				преимущества вашей компании, для этого Маркетологу необходимо определить
				цели сайта — что он конкретно сделает для вашего бизнеса; провести
				краткий анализ целевой аудитории — для кого вы делаете сайт, какие
				потребности у этих людей; проработать пользовательские сценарии — как
				ваши посетители будут пользоваться сайтом, как вы планируете доводить их
				до нужного вам действия.
			</p>
		</>
	)
}
const Screen3 = () => {
	return (
		<>
			<p>
				Дизайн страницы – это трудоемкая работа, которая занимает треть
				трудозатрат от всего проекта. Без этого этапа сайт получиться унылым и
				скучным, блоки на сайте будут негармонично отображаться. Мы не беремся
				делать сайты без дизайна, потому что каждый проект мы добавляем в наше
				портфолио, а как известно упаковка имеет очень важное значение при
				выборе продукта. Наши дизайнеры не только умеют пользоваться
				специализированными программами, но и очень красиво рисуют, поэтому наши
				готовые проекты занимают высокие позиции на просторах интернета и
				нравятся людям.
			</p>
		</>
	)
}
const Screen4 = () => {
	return (
		<>
			<p>
				На данном шаге происходят чисто техническая работа, которая не видно
				Заказчику, качество которой зависит от профессиональных навыков
				верстальщика.
			</p>
			<br />

			<p>
				HTML Код на сайте должен быть красивым. Это простое правило, чем меньше
				будет кода тем быстрее загрузится сайт. ость (корректность) — Верное
				использование функционала CMS при внедрении дизайна/структуры/модулей —
				позволит без труда разобраться с системой стороннему специалисту.
				Кроссбраузерная верстка (Cross-browser) — адекватное отображение сайта
				во всевозможных браузерах (IE, Chrome, Firefox, Opera и т.д.)
			</p>
			<br />

			<p>
				В результате данных нескольких этапов работ мы получим полностью рабочий
				сайт, но без какого-либо наполнения.
			</p>
		</>
	)
}
const Screen5 = () => {
	return (
		<>
			<p>
				На сегодняшний день все больше людей пользуются мобильными устройствами.
				Из статистики посещаемости сайтов видно что более 60% переходов
				происходит именно с мобильных устройств. Сайты которые имеют мобильную
				версию ранжируются выше в поисковой выдаче. При просмотре мобильной
				версии сайта дизайн будет узнаваем на всех устройствах, только элементы
				будут сдвигаться по вертикали. Некоторые элементы не будут отображаться
				или будут отображаться в более компактном виде. Сайт для мобильных
				устройств будет доступен по тому же адресу, что и основной сайт, только
				шаблон его будет существенно отличаться от шаблона основного сайта, он
				будет значительно упрощен, но все-таки узнаваем.
			</p>
		</>
	)
}
const Screen6 = () => {
	return (
		<>
			<p>
				Этап № 6Интеграция и запуск сайтаФормы являются основным модулем для
				взаимодействия с клиентом. Для того чтобы клиент мог оставить заявку на
				продукцию или заявку на обратный звонок ему нужен инструмент для ввода
				своих данных,эти инструментом являются формы. При заполнении всех
				элементов формы и нажатию на кнопку отправить происходит процесс
				отправки данных на различные сервисы. Самым простым и дешевым
				получателем данных формы является Email, но при необходимости можно
				настроить и другие системы (Email, SMS, WhatsApp, Telegramm, CRM и др.).
			</p>
		</>
	)
}
const Screen7 = () => {
	return (
		<>
			<p>
				Без тестирования сайта его нельзя выкладывать в интернете. Представьте
				ситуацию, что вы вложили деньги в рекламу, потенциальные клиенты заходят
				к вам на сайт и банально не смогут отправить заявку. Исключать этот этап
				ни в коем случае нельзя. Вспомните хотя бы количество ошибок после смены
				дизайна «ВКонтакте» или заплаток на свежевышедшую Windows 10 — всё это
				осталось после серьёзного тестирования, а представьте, что творилось бы
				без него! Перед сдачей проекта, тестировщик проверяется сайт на наличие
				ошибок в коде, все ли картинки грузятся и правильно ли отображается
				контент, проверяет работу форм на сайте, проверяет отображения сайта на
				различных устройствах и прочее.
			</p>
		</>
	)
}
const Screen8 = () => {
	return (
		<>
			<p>
				На этом этапе сайта размещается на хостинге Исполнителя. По
				договоренности, Исполнитель может перенести проект на хостинг заказчика
				или оставить его у себя. Заказчик должен предоставить или купить вместе
				с исполнителем доменное имя (адрес сайта). Если в ТЗ были оговорены
				какие-либо предварительные работы по СЕО, например, добавления сайта в
				вебмастера Яндекс и Google, создание HTML карты сайта, установка метрики
				и аналитики, то исполнитель их проводит.
			</p>
		</>
	)
}

export {
	Screen1,
	Screen2,
	Screen3,
	Screen4,
	Screen5,
	Screen6,
	Screen7,
	Screen8,
}
