export const plusLow = [
    'быстрее, от 7 до 15 дней под ключ',
    'дешевле, что очевидно',
    'проще, т.к. даже небольшие изменения можно внести быстро как самим, так и через нас',
    'много интеграций, оплата на сайте, СДЭК, и другие',
]
export const minusLow = [
    'платный тариф: 750р/мес или 6000р/год минимум',
    'очень мало возможностей',
    "некоторые интересные решения делаются только через 'костыли' и могут работать криво",
    'скромный функционал корзины, фильтрации и сортировки',
    'сложности в масштабировании',
]

export const plusHigh = [
    'неограниченные возможности',
    'быстрое масштабирование',
    'независимость от сторонних сервисов',
    'более интересный дизайн',
    'seo оптимизирован',
    'быстрая скорость открытия',
]

export const minusHigh = [
    'дороже',
    'дольше',
    'требуется хостинг',
    'участие программиста и верстальщика',
]
