'use client'
import Link from 'next/link'
import './Footer.css'

function Footer() {
	return (
		<>
			<footer>
				<div className='content-block'>
					<div className='nav-block'>
						<Link
							href='/'
							onClick={() => window.scrollTo(0, 0)}
							className='logo'
						>
							<div className='logo-text cormorant-garamond-bold text-5xl '>
								VIRLAB
							</div>
							{/* <img src={logo} height={35} alt="logo" /> */}
						</Link>
					</div>
					<div className='footer-container'>
						<div className='nav-container'>
							<div className='nav-block'>
								<Link
									href='/'
									onClick={() => window.scrollTo(0, 0)}
									className='nav-link'
								>
									Главная
								</Link>
								<Link
									href='/development'
									onClick={() => window.scrollTo(0, 0)}
									className='nav-link'
								>
									Услуги
								</Link>
								<Link
									href='/projects'
									onClick={() => window.scrollTo(0, 0)}
									className='nav-link'
								>
									Проекты
								</Link>
								<Link
									href='/contacts'
									onClick={() => window.scrollTo(0, 0)}
									className='nav-link'
								>
									Контакты
								</Link>
							</div>
							<p>© 2024 VIRLAB. Все права защищены.</p>
						</div>
						<div className='nav-container'>
							<div className='nav-block'>
								<Link
									href='https://t.me/nev_3d'
									onClick={() => window.scrollTo(0, 0)}
									className='nav-connection'
								>
									<svg
										width='100px'
										height='100px'
										viewBox='0 0 1000 1000'
										version='1.1'
										xmlns='http://www.w3.org/2000/svg'
										xmlnsXlink='http://www.w3.org/1999/xlink'
									>
										<g
											id='Artboard'
											stroke='none'
											strokeWidth='1'
											fill='none'
											fillRule='evenodd'
										>
											<circle
												id='Oval'
												fill='currentColor'
												cx='500'
												cy='500'
												r='500'
											></circle>
											<path
												d='M226.328419,494.722069 C372.088573,431.216685 469.284839,389.350049 517.917216,369.122161 C656.772535,311.36743 685.625481,301.334815 704.431427,301.003532 C708.567621,300.93067 717.815839,301.955743 723.806446,306.816707 C728.864797,310.92121 730.256552,316.46581 730.922551,320.357329 C731.588551,324.248848 732.417879,333.113828 731.758626,340.040666 C724.234007,419.102486 691.675104,610.964674 675.110982,699.515267 C668.10208,736.984342 654.301336,749.547532 640.940618,750.777006 C611.904684,753.448938 589.856115,731.588035 561.733393,713.153237 C517.726886,684.306416 492.866009,666.349181 450.150074,638.200013 C400.78442,605.66878 432.786119,587.789048 460.919462,558.568563 C468.282091,550.921423 596.21508,434.556479 598.691227,424.000355 C599.00091,422.680135 599.288312,417.758981 596.36474,415.160431 C593.441168,412.561881 589.126229,413.450484 586.012448,414.157198 C581.598758,415.158943 511.297793,461.625274 375.109553,553.556189 C355.154858,567.258623 337.080515,573.934908 320.886524,573.585046 C303.033948,573.199351 268.692754,563.490928 243.163606,555.192408 C211.851067,545.013936 186.964484,539.632504 189.131547,522.346309 C190.260287,513.342589 202.659244,504.134509 226.328419,494.722069 Z'
												id='Path-3'
												fill='#181f24'
											></path>
										</g>
									</svg>
								</Link>
								<Link
									href='https://wa.me/89505940280'
									onClick={() => window.scrollTo(0, 0)}
									className='nav-connection'
								>
									<svg
										xmlns='http://www.w3.org/2000/svg'
										x='0px'
										y='0px'
										width='100'
										height='100'
										viewBox='3.5 3.5 24.5 24.5'
										fill='currentColor'
									>
										<path
											fillRule='evenodd'
											d='M 24.503906 7.503906 C 22.246094 5.246094 19.246094 4 16.050781 4 C 9.464844 4 4.101563 9.359375 4.101563 15.945313 C 4.097656 18.050781 4.648438 20.105469 5.695313 21.917969 L 4 28.109375 L 10.335938 26.445313 C 12.078125 27.398438 14.046875 27.898438 16.046875 27.902344 L 16.050781 27.902344 C 22.636719 27.902344 27.996094 22.542969 28 15.953125 C 28 12.761719 26.757813 9.761719 24.503906 7.503906 Z M 16.050781 25.882813 L 16.046875 25.882813 C 14.265625 25.882813 12.515625 25.402344 10.992188 24.5 L 10.628906 24.285156 L 6.867188 25.269531 L 7.871094 21.605469 L 7.636719 21.230469 C 6.640625 19.648438 6.117188 17.820313 6.117188 15.945313 C 6.117188 10.472656 10.574219 6.019531 16.054688 6.019531 C 18.707031 6.019531 21.199219 7.054688 23.074219 8.929688 C 24.949219 10.808594 25.980469 13.300781 25.980469 15.953125 C 25.980469 21.429688 21.523438 25.882813 16.050781 25.882813 Z M 21.496094 18.445313 C 21.199219 18.296875 19.730469 17.574219 19.457031 17.476563 C 19.183594 17.375 18.984375 17.328125 18.785156 17.625 C 18.585938 17.925781 18.015625 18.597656 17.839844 18.796875 C 17.667969 18.992188 17.492188 19.019531 17.195313 18.871094 C 16.894531 18.722656 15.933594 18.40625 14.792969 17.386719 C 13.90625 16.597656 13.304688 15.617188 13.132813 15.320313 C 12.957031 15.019531 13.113281 14.859375 13.261719 14.710938 C 13.398438 14.578125 13.5625 14.363281 13.710938 14.1875 C 13.859375 14.015625 13.910156 13.890625 14.011719 13.691406 C 14.109375 13.492188 14.058594 13.316406 13.984375 13.167969 C 13.910156 13.019531 13.3125 11.546875 13.0625 10.949219 C 12.820313 10.367188 12.574219 10.449219 12.390625 10.4375 C 12.21875 10.429688 12.019531 10.429688 11.820313 10.429688 C 11.621094 10.429688 11.296875 10.503906 11.023438 10.804688 C 10.75 11.101563 9.980469 11.824219 9.980469 13.292969 C 9.980469 14.761719 11.050781 16.183594 11.199219 16.382813 C 11.347656 16.578125 13.304688 19.59375 16.300781 20.886719 C 17.011719 21.195313 17.566406 21.378906 18 21.515625 C 18.714844 21.742188 19.367188 21.710938 19.882813 21.636719 C 20.457031 21.550781 21.648438 20.914063 21.898438 20.214844 C 22.144531 19.519531 22.144531 18.921875 22.070313 18.796875 C 21.996094 18.671875 21.796875 18.597656 21.496094 18.445313 Z'
										></path>
									</svg>
								</Link>
								<Link
									href='https://vk.com/virlab'
									onClick={() => window.scrollTo(0, 0)}
									className='nav-connection'
								>
									<svg
										width='100'
										height='100'
										viewBox='0 0 100 100'
										fill='none'
										xmlns='http://www.w3.org/2000/svg'
									>
										<path
											d='M0 48C0 25.3726 0 14.0589 7.02944 7.02944C14.0589 0 25.3726 0 48 0H52C74.6274 0 85.9411 0 92.9706 7.02944C100 14.0589 100 25.3726 100 48V52C100 74.6274 100 85.9411 92.9706 92.9706C85.9411 100 74.6274 100 52 100H48C25.3726 100 14.0589 100 7.02944 92.9706C0 85.9411 0 74.6274 0 52V48Z'
											fill='currentColor'
										/>
										<path
											d='M53.2082 72.042C30.4165 72.042 17.4167 56.417 16.875 30.417H28.2916C28.6666 49.5003 37.0831 57.5836 43.7498 59.2503V30.417H54.5001V46.8752C61.0835 46.1669 67.9993 38.667 70.3326 30.417H81.083C79.2913 40.5837 71.7913 48.0836 66.4579 51.1669C71.7913 53.6669 80.3334 60.2086 83.5834 72.042H71.7497C69.208 64.1253 62.8751 58.0003 54.5001 57.1669V72.042H53.2082Z'
											fill='#181f24'
										/>
									</svg>
								</Link>
							</div>
							<div className='mail-tel'>
								<a href='mailto:virlab42@mail.ru'>virlab42@mail.ru</a>
								<a href='tel:89505940280'> +7 (950) 594-02-80</a>
							</div>
						</div>
					</div>
				</div>

				{/* МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА */}
				{/* МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА */}
				{/* МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА */}

				<div className='content-block-mob'>
					<div className='nav-block footer-logo'>
						<Link
							href='/'
							onClick={() => window.scrollTo(0, 0)}
							className='logo'
						>
							<div className='logo-text text-4xl cormorant-garamond-bold'>
								VIRLAB
							</div>
							{/* <img height={35} src={logo} alt="logo" /> */}
						</Link>
					</div>
					<div className='footer-container'>
						<div className='nav-container'>
							<div className='nav-block menu'>
								<Link
									href='/'
									onClick={() => window.scrollTo(0, 0)}
									className='nav-link'
								>
									Главная
								</Link>
								<Link
									href='/development'
									onClick={() => window.scrollTo(0, 0)}
									className='nav-link'
								>
									Услуги
								</Link>
								<Link
									href='/projects'
									onClick={() => window.scrollTo(0, 0)}
									className='nav-link'
								>
									Проекты
								</Link>
								<Link
									href='/contacts'
									onClick={() => window.scrollTo(0, 0)}
									className='nav-link'
								>
									Контакты
								</Link>
							</div>
						</div>
						<div className='nav-container'>
							<div className='nav-block nav-block-connection'>
								<div className='flex gap-3'>
									<Link
										href='https://t.me/nev_3d'
										onClick={() => window.scrollTo(0, 0)}
										className='nav-connection'
									>
										<svg
											width='100px'
											height='100px'
											viewBox='0 0 1000 1000'
											version='1.1'
											xmlns='http://www.w3.org/2000/svg'
											xmlnsXlink='http://www.w3.org/1999/xlink'
										>
											<g
												id='Artboard'
												stroke='none'
												strokeWidth='1'
												fill='none'
												fillRule='evenodd'
											>
												<circle
													id='Oval'
													fill='currentColor'
													cx='500'
													cy='500'
													r='500'
												></circle>
												<path
													d='M226.328419,494.722069 C372.088573,431.216685 469.284839,389.350049 517.917216,369.122161 C656.772535,311.36743 685.625481,301.334815 704.431427,301.003532 C708.567621,300.93067 717.815839,301.955743 723.806446,306.816707 C728.864797,310.92121 730.256552,316.46581 730.922551,320.357329 C731.588551,324.248848 732.417879,333.113828 731.758626,340.040666 C724.234007,419.102486 691.675104,610.964674 675.110982,699.515267 C668.10208,736.984342 654.301336,749.547532 640.940618,750.777006 C611.904684,753.448938 589.856115,731.588035 561.733393,713.153237 C517.726886,684.306416 492.866009,666.349181 450.150074,638.200013 C400.78442,605.66878 432.786119,587.789048 460.919462,558.568563 C468.282091,550.921423 596.21508,434.556479 598.691227,424.000355 C599.00091,422.680135 599.288312,417.758981 596.36474,415.160431 C593.441168,412.561881 589.126229,413.450484 586.012448,414.157198 C581.598758,415.158943 511.297793,461.625274 375.109553,553.556189 C355.154858,567.258623 337.080515,573.934908 320.886524,573.585046 C303.033948,573.199351 268.692754,563.490928 243.163606,555.192408 C211.851067,545.013936 186.964484,539.632504 189.131547,522.346309 C190.260287,513.342589 202.659244,504.134509 226.328419,494.722069 Z'
													id='Path-3'
													fill='#181f24'
												></path>
											</g>
										</svg>
									</Link>
									<Link
										href='https://wa.me/89505940280'
										onClick={() => window.scrollTo(0, 0)}
										className='nav-connection'
									>
										<svg fill="#968c76"
										className="whatsapp"
										xmlns="http://www.w3.org/2000/svg"  
										viewBox="0 0 50 50" 
										width="50px" 
										height="50px">    
										<path d="M25,2C12.318,2,2,12.318,2,25c0,3.96,1.023,7.854,2.963,11.29L2.037,46.73c-0.096,0.343-0.003,0.711,0.245,0.966 C2.473,47.893,2.733,48,3,48c0.08,0,0.161-0.01,0.24-0.029l10.896-2.699C17.463,47.058,21.21,48,25,48c12.682,0,23-10.318,23-23 S37.682,2,25,2z M36.57,33.116c-0.492,1.362-2.852,2.605-3.986,2.772c-1.018,0.149-2.306,0.213-3.72-0.231 c-0.857-0.27-1.957-0.628-3.366-1.229c-5.923-2.526-9.791-8.415-10.087-8.804C15.116,25.235,13,22.463,13,19.594 s1.525-4.28,2.067-4.864c0.542-0.584,1.181-0.73,1.575-0.73s0.787,0.005,1.132,0.021c0.363,0.018,0.85-0.137,1.329,1.001 c0.492,1.168,1.673,4.037,1.819,4.33c0.148,0.292,0.246,0.633,0.05,1.022c-0.196,0.389-0.294,0.632-0.59,0.973 s-0.62,0.76-0.886,1.022c-0.296,0.291-0.603,0.606-0.259,1.19c0.344,0.584,1.529,2.493,3.285,4.039 c2.255,1.986,4.158,2.602,4.748,2.894c0.59,0.292,0.935,0.243,1.279-0.146c0.344-0.39,1.476-1.703,1.869-2.286 s0.787-0.487,1.329-0.292c0.542,0.194,3.445,1.604,4.035,1.896c0.59,0.292,0.984,0.438,1.132,0.681 C37.062,30.587,37.062,31.755,36.57,33.116z"/>
										</svg>
									</Link>
									<Link
										href='https://vk.com/virlab'
										onClick={() => window.scrollTo(0, 0)}
										className='nav-connection'
									>
										<svg
											width='130'
											height='130'
											viewBox='0 0 100 100'
											fill='none'
											xmlns='http://www.w3.org/2000/svg'
										>
											<path
												d='M0 48C0 25.3726 0 14.0589 7.02944 7.02944C14.0589 0 25.3726 0 48 0H52C74.6274 0 85.9411 0 92.9706 7.02944C100 14.0589 100 25.3726 100 48V52C100 74.6274 100 85.9411 92.9706 92.9706C85.9411 100 74.6274 100 52 100H48C25.3726 100 14.0589 100 7.02944 92.9706C0 85.9411 0 74.6274 0 52V48Z'
												fill='currentColor'
											/>
											<path
												d='M53.2082 72.042C30.4165 72.042 17.4167 56.417 16.875 30.417H28.2916C28.6666 49.5003 37.0831 57.5836 43.7498 59.2503V30.417H54.5001V46.8752C61.0835 46.1669 67.9993 38.667 70.3326 30.417H81.083C79.2913 40.5837 71.7913 48.0836 66.4579 51.1669C71.7913 53.6669 80.3334 60.2086 83.5834 72.042H71.7497C69.208 64.1253 62.8751 58.0003 54.5001 57.1669V72.042H53.2082Z'
												fill='#181f24'
											/>
										</svg>
									</Link>
								</div>
								<a className='nav-connection' href='mail:virlab42@mail.ru'>
									virlab42@mail.ru
								</a>
								<a className='nav-connection' href='tel:89505940280'>
									+7 (950) 594-02-80
								</a>
							</div>
						</div>
					</div>

					<p className='prava'>© 2024 VIRLAB. Все права защищены.</p>
				</div>

				{/* МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА */}
				{/* МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА */}
				{/* МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА МОБИЛКА */}
			</footer>
		</>
	)
}
export default Footer
