export const advantage = {
	development: [
		{
			title: 'Уникальный дизайн и индивидуальный подход',
			subtitle:
				'Уникальный дизайн и эффективная структура сайта помогут\
									привлечь внимание вашей целевой аудитории и увеличить\
									конверсию. Каждый проект — индивидуальная разработка.',
		},
		{
			title: 'Конверсия в 2- 3,5 раза выше, чем у конкурентов',
			subtitle:
				'Маркетинговое исследование формирует контент и структуру для\
									удержания внимания посетителей. Ответы на запросы клиентов\
									устраняют сомнения в принятии решения..',
		},
		{
			title: 'Щепотка психологии:  Мощь и магия!',
			subtitle:
				'Мы используем принципы психологии для создания интуитивных\
										интерфейсов и контента. Анализируя потребности и ожидания\
										аудитории, учитываем их мотивы и предпочтения.',
		},
	],
	tilda: [
		{
			title: 'Полный цикл разработки сайта для бизнеса',
			subtitle:
				'Мы обеспечиваем все этапы создания сайта: от идеи и дизайна до внедрения функционала и запуска. Каждый проект адаптирован под потребности вашего бизнеса, чтобы сайт эффективно решал задачи и привлекал клиентов.',
		},
		{
			title: 'Уникальный и привлекательный дизайн под ваши цели',
			subtitle:
				'Мы создаем дизайн, который отражает индивидуальность вашего бренда и привлекает внимание целевой аудитории.Каждая деталь продумана, чтобы сайт не только выглядел стильно, но и обеспечивал удобство для пользователей.',
		},
		{
			title: 'Интеграция с удобными сервисами и инструментами',
			subtitle:
				'Мы настраиваем все необходимые инструменты для эффективной работы вашего бизнеса: от платежных систем до CRM и аналитики. Это позволяет автоматизировать процессы и улучшить взаимодействие с клиентами, обеспечивая рост и удобство работы.',
		},
	],
	taplink: [
		{
			title: 'Объединение всех ссылок на одной странице',
			subtitle:
				'Вместо множества ссылок в профиле, Taplink позволяет собрать все важные ресурсы (товары, акции, контакты) в одном месте. Это упрощает клиентам поиск необходимой информации.',
		},
		{
			title: 'Повышение конверсии и продаж',
			subtitle:
				'С помощью Taplink можно направлять пользователей на страницы с продуктами, услугами или акциями.Что способствует увеличению покупок и других целевых действий, таких как заявки или подписки.',
		},
		{
			title: 'Аналитика и оптимизация',
			subtitle:
				'Taplink предоставляет статистику по переходам, что помогает отслеживать эффективность ссылок.Понимать интересы клиентов и корректировать маркетинговые стратегии для повышения вовлеченности и роста продаж.',
		},
	],
	logos: [
		{
			title: 'Логотипы',
			subtitle:
				'Мы создаем уникальные логотипы, которые отражают суть вашего бизнеса и запоминаются.\
				Логотипы адаптируются для любых форматов и выглядят стильно на визитках, баннерах и сайтах.',
		},
		{
			title: 'Баннеры',
			subtitle:
				'Разрабатываем яркие баннеры, которые привлекут внимание и донесут вашу идею.\
        Баннеры оптимизируем под любые платформы и устройства.',
		},
		{
			title: 'Монтаж видео',
			subtitle:
				'Профессионально монтируем видео, добавляя эффектные переходы и анимацию.\
        Мы учитываем вашу целевую аудиторию и цели при создании видео-контента.',
		},
	],
}
