export const why = {
	default: {
		title: 'ПОЧЕМУ НАШИ САЙТЫ ЭФФЕКТИВНЫ?',
		text: 'Маркетинг, уникальный дизайн, легкость и удобство, мобильная       адаптация, безопасность, SEO-адаптация',
	},
	tilda: {
		title: 'Почему наши сайты работают на вас?',
		text: 'Мы создаем сайты, которые привлекают клиентов и увеличивают продажи.\
          Каждый проект — это результат вашей идеи и нашего опыта.',
	},
	logos: {
		title: 'Какие наши продукты работают на вас?',
		text: 'Мы создаем продукт, который привлекает клиентов и увеличивают продажи.\
    Каждый продукт — это результат ваших идей и нашего опыта.',
	},
	taplink: {
		title: 'Taplink необходим по следующим причинам:',
		text: 'Мы создаем Таплинки, которые привлекают клиентов и увеличивают  продажи.\
    Каждый проект — это результат вашей идеи и нашего опыта.',
	},
}
