import './contacts.scss'
import Maps from './partials/map'

export const metadata = {
	metadataBase: new URL('https://virlab42.ru'),
	title: 'Контакты VIRLAB — Свяжитесь с IT-компанией для сотрудничества',
	description:
		'Свяжитесь с командой VIRLAB — обсудим создание вашего сайта, печать на 3D-принтере, разработку дизайна или продвижение в интернете.',
	keywords:
		'контакты VIRLAB, связаться с айти-компанией, разработка сайтов на заказ, услуги 3D-печати',
	alternates: {
		canonical: '/contacts',
	},
	openGraph: {
		url: '/contacts',
		title: 'Контакты VIRLAB — Свяжитесь с IT-компанией для сотрудничества',
		description:
			'Свяжитесь с командой VIRLAB — обсудим создание вашего сайта, печать на 3D-принтере, разработку дизайна или продвижение в интернете.',
		images: {
			url: '/og/og.jpg',
			width: 1200,
			height: 630,
		},
	},
}

function Contacts() {
	return (
		<>
			<div className=' contacts pt-[91px] md:pt-[120px]'>
				<div className='header-contacts'>
					<h1 className='cormorant-garamond-bold'>Контакты</h1>
				</div>

				<div className='body-contacts'>
					<div className='left-body-contacts'>
						<a href='https://t.me/nev_3d' className='contacts-square'>
							<svg
								width='1000px'
								height='1000px'
								viewBox='0 0 1000 1000'
								version='1.1'
								xmlns='http://www.w3.org/2000/svg'
								xmlnsXlink='http://www.w3.org/1999/xlink'
							>
								<g
									id='Artboard'
									stroke='none'
									strokeWidth='1'
									fill='none'
									fillRule='evenodd'
								>
									<circle
										id='Oval'
										fill='currentColor'
										cx='500'
										cy='500'
										r='500'
									></circle>
									<path
										d='M226.328419,494.722069 C372.088573,431.216685 469.284839,389.350049 517.917216,369.122161 C656.772535,311.36743 685.625481,301.334815 704.431427,301.003532 C708.567621,300.93067 717.815839,301.955743 723.806446,306.816707 C728.864797,310.92121 730.256552,316.46581 730.922551,320.357329 C731.588551,324.248848 732.417879,333.113828 731.758626,340.040666 C724.234007,419.102486 691.675104,610.964674 675.110982,699.515267 C668.10208,736.984342 654.301336,749.547532 640.940618,750.777006 C611.904684,753.448938 589.856115,731.588035 561.733393,713.153237 C517.726886,684.306416 492.866009,666.349181 450.150074,638.200013 C400.78442,605.66878 432.786119,587.789048 460.919462,558.568563 C468.282091,550.921423 596.21508,434.556479 598.691227,424.000355 C599.00091,422.680135 599.288312,417.758981 596.36474,415.160431 C593.441168,412.561881 589.126229,413.450484 586.012448,414.157198 C581.598758,415.158943 511.297793,461.625274 375.109553,553.556189 C355.154858,567.258623 337.080515,573.934908 320.886524,573.585046 C303.033948,573.199351 268.692754,563.490928 243.163606,555.192408 C211.851067,545.013936 186.964484,539.632504 189.131547,522.346309 C190.260287,513.342589 202.659244,504.134509 226.328419,494.722069 Z'
										id='Path-3'
										fill='#FFFFFF'
									></path>
								</g>
							</svg>
						</a>
						<a href='https://wa.me/89505940280' className='contacts-square'>
						<svg 
							className="whatsapp"
							fill="#968c76" 
							xmlns="http://www.w3.org/2000/svg"  
							viewBox="0 0 50 50" 
							width="54px" 
							height="54px">    
							<path d="M25,2C12.318,2,2,12.318,2,25c0,3.96,1.023,7.854,2.963,11.29L2.037,46.73c-0.096,0.343-0.003,0.711,0.245,0.966 C2.473,47.893,2.733,48,3,48c0.08,0,0.161-0.01,0.24-0.029l10.896-2.699C17.463,47.058,21.21,48,25,48c12.682,0,23-10.318,23-23 S37.682,2,25,2z M36.57,33.116c-0.492,1.362-2.852,2.605-3.986,2.772c-1.018,0.149-2.306,0.213-3.72-0.231 c-0.857-0.27-1.957-0.628-3.366-1.229c-5.923-2.526-9.791-8.415-10.087-8.804C15.116,25.235,13,22.463,13,19.594 s1.525-4.28,2.067-4.864c0.542-0.584,1.181-0.73,1.575-0.73s0.787,0.005,1.132,0.021c0.363,0.018,0.85-0.137,1.329,1.001 c0.492,1.168,1.673,4.037,1.819,4.33c0.148,0.292,0.246,0.633,0.05,1.022c-0.196,0.389-0.294,0.632-0.59,0.973 s-0.62,0.76-0.886,1.022c-0.296,0.291-0.603,0.606-0.259,1.19c0.344,0.584,1.529,2.493,3.285,4.039 c2.255,1.986,4.158,2.602,4.748,2.894c0.59,0.292,0.935,0.243,1.279-0.146c0.344-0.39,1.476-1.703,1.869-2.286 s0.787-0.487,1.329-0.292c0.542,0.194,3.445,1.604,4.035,1.896c0.59,0.292,0.984,0.438,1.132,0.681 C37.062,30.587,37.062,31.755,36.57,33.116z"/>
						</svg>
						</a>
						<a href='https://vk.com/virlab' className='contacts-square'>
							<svg
								width='100'
								height='100'
								viewBox='0 0 100 100'
								fill='none'
								xmlns='http://www.w3.org/2000/svg'
							>
								<path
									d='M0 48C0 25.3726 0 14.0589 7.02944 7.02944C14.0589 0 25.3726 0 48 0H52C74.6274 0 85.9411 0 92.9706 7.02944C100 14.0589 100 25.3726 100 48V52C100 74.6274 100 85.9411 92.9706 92.9706C85.9411 100 74.6274 100 52 100H48C25.3726 100 14.0589 100 7.02944 92.9706C0 85.9411 0 74.6274 0 52V48Z'
									fill='currentColor'
								/>
								<path
									d='M53.2082 72.042C30.4165 72.042 17.4167 56.417 16.875 30.417H28.2916C28.6666 49.5003 37.0831 57.5836 43.7498 59.2503V30.417H54.5001V46.8752C61.0835 46.1669 67.9993 38.667 70.3326 30.417H81.083C79.2913 40.5837 71.7913 48.0836 66.4579 51.1669C71.7913 53.6669 80.3334 60.2086 83.5834 72.042H71.7497C69.208 64.1253 62.8751 58.0003 54.5001 57.1669V72.042H53.2082Z'
									fill='white'
								/>
							</svg>
						</a>
					</div>
					<div className='right-body-contacts'>
						<div className='right-body-contacts-content'>
							<div>
								<h4>ТЕЛЕФОН</h4>
								<a href='tel:89505940280'>
									<p>
										<span className='color'>
											<svg
												xmlns='http://www.w3.org/2000/svg'
												width='18'
												height='18'
												fill='#968c76'
												className='bi bi-telephone-fill'
												viewBox='0 0 16 16'
											>
												<path
													fillRule='evenodd'
													d='M1.885.511a1.745 1.745 0 0 1 2.61.163L6.29 2.98c.329.423.445.974.315 1.494l-.547 2.19a.68.68 0 0 0 .178.643l2.457 2.457a.68.68 0 0 0 .644.178l2.189-.547a1.75 1.75 0 0 1 1.494.315l2.306 1.794c.829.645.905 1.87.163 2.611l-1.034 1.034c-.74.74-1.846 1.065-2.877.702a18.6 18.6 0 0 1-7.01-4.42 18.6 18.6 0 0 1-4.42-7.009c-.362-1.03-.037-2.137.703-2.877z'
												/>
											</svg>
											+7 (999) 431-62-66
										</span>
									</p>
								</a>
							</div>
							<div>
								<h4>АДРЕС</h4>
								<p>
									<span className='color'>
										<svg
											viewBox='0 0 1024 1024'
											width={18}
											height={18}
											fill='#968c76'
											className='icon'
											version='1.1'
											xmlns='http://www.w3.org/2000/svg'
										>
											<g id='SVGRepo_bgCarrier' strokeWidth='0'></g>
											<g
												id='SVGRepo_tracerCarrier'
												strokeLinecap='round'
												strokeLinejoin='round'
											></g>
											<g id='SVGRepo_iconCarrier'>
												<path
													d='M512 1012.8c-253.6 0-511.2-54.4-511.2-158.4 0-92.8 198.4-131.2 283.2-143.2h3.2c12 0 22.4 8.8 24 20.8 0.8 6.4-0.8 12.8-4.8 17.6-4 4.8-9.6 8.8-16 9.6-176.8 25.6-242.4 72-242.4 96 0 44.8 180.8 110.4 463.2 110.4s463.2-65.6 463.2-110.4c0-24-66.4-70.4-244.8-96-6.4-0.8-12-4-16-9.6-4-4.8-5.6-11.2-4.8-17.6 1.6-12 12-20.8 24-20.8h3.2c85.6 12 285.6 50.4 285.6 143.2 0.8 103.2-256 158.4-509.6 158.4z m-16.8-169.6c-12-11.2-288.8-272.8-288.8-529.6 0-168 136.8-304.8 304.8-304.8S816 145.6 816 313.6c0 249.6-276.8 517.6-288.8 528.8l-16 16-16-15.2zM512 56.8c-141.6 0-256.8 115.2-256.8 256.8 0 200.8 196 416 256.8 477.6 61.6-63.2 257.6-282.4 257.6-477.6C768.8 172.8 653.6 56.8 512 56.8z m0 392.8c-80 0-144.8-64.8-144.8-144.8S432 160 512 160c80 0 144.8 64.8 144.8 144.8 0 80-64.8 144.8-144.8 144.8zM512 208c-53.6 0-96.8 43.2-96.8 96.8S458.4 401.6 512 401.6c53.6 0 96.8-43.2 96.8-96.8S564.8 208 512 208z'
													fill=''
												></path>
											</g>
										</svg>
										ул. Кирова 37 (ЦУМ), 4 этаж, оф.12 
									</span>
								</p>
							</div>
							<div>
								<h4>ПОЧТА</h4>
								<a href='mailto:virlab42@mail.ru'>
									<p>
										<span className='color'>
											<svg
												fill='#968c76'
												width={18}
												height={18}
												viewBox='0 0 1920 1920'
												xmlns='http://www.w3.org/2000/svg'
											>
												<g id='SVGRepo_bgCarrier' strokeWidth='0'></g>
												<g
													id='SVGRepo_tracerCarrier'
													strokeLinecap='round'
													strokeLinejoin='round'
												></g>
												<g id='SVGRepo_iconCarrier'>
													{' '}
													<path
														d='M0 1694.235h1920V226H0v1468.235ZM112.941 376.664V338.94H1807.06v37.723L960 1111.233l-847.059-734.57ZM1807.06 526.198v950.513l-351.134-438.89-88.32 70.475 378.353 472.998H174.042l378.353-472.998-88.32-70.475-351.134 438.89V526.198L960 1260.768l847.059-734.57Z'
														fillRule='evenodd'
													></path>{' '}
												</g>
											</svg>
											virlab42@mail.ru
										</span>
									</p>
								</a>
							</div>
						</div>
					</div>
				</div>
				<div className='contacts-footer'>
					<Maps />
				</div>
			</div>
		</>
	)
}

export default Contacts
